do

function run(msg, matches)
  return ' '.. VERSION .. [[
  به نام خدا
  راهنمای دستورات ربات ضد اسپم کروکودیل
  #commands : نمایش دستورات تمامی پلاگین 
#rank mod (reply) : افزودن مدیر گروه با ریپلی کردن پیام او
#rank mod <user_id>/<user_name> : افزودن مدیر گروه با استفاده از یوزرنیم و یا آیدی او
#rank guest (reply) : گرفتن مقام ادمین ادمین با ریپلی
#rank guest <user_id>/<user_name> : گرفتن مقام ادمین ادمین بوسیله یوزرنیم و یا آی دی
#admins : لیست تمامی ادمین های موجود این ربات
#mods : لیست تمامی مدیران موجود این گروه
#members : لیست تمامی اعضای این گروه/سوپر گروه
#id : نشان دادن آیدی شما و آیدی گروه / سوپر گروهی که در آن حضور دارید
#ids chat : نشان دادن آیدی گروهی که در آن هستید
#ids channel : نشان دادن آیدی سوپر گروهی که در آن هستید
#id <user_name> : نشان دادن آیدی یک شخص دیگر با استفاده از یوزرنیم او
#whois <user_id>/<user_name> : نشان دادن یوزرنیم یک شخص دیگر با استفاده از آیدی ا
#whois (reply) : نشان دادن آیدی و یوزرنیم شخص مورد نظر شما با ریپلی کردن پیام او
#add : با ریپلی کردن پیام شخصی ، او را به این گروه/سوپر گروه بیافزایید
#add <id>/<username> : افزودن شخصی به این گروه/سوپر گروه با استفاده از آیدی و یا یوزرنیم او
#kick : با ریپلی کردن پیام شخصی ، او را از گروه بیرون کنید
#kick <id>/<username> : با استفاده از یوزرنیم و یا آیدی شخصی او را از گروه بیرون کنید
#kickme : خودتان را از گروه اخراج کنید')
#ban : با ریپلی کردن پیامی از شخصی او را از گروه بیرون و او را مسدود کنید تا توانایی ورود دوباره به گروه را نداشته باشد
#ban <id>/<username> : با استفاده از آیدی و یا یوزرنیم شخصی او را از گروه بیرون و او را مسدود کنید تا توانایی ورود دوباره به گروه را نداشته باشد')
#unban : با ریپلی کردن پیام شخصی او را از حالت مسدود خارج کنید
#unban <id>/<username> : با استفاده از آیدی و یا یوزرنیم شخصی او را از حالت مسدود خارج کنید
#mute : با ریپلی کردن پیامی از شخصی ، اجازه صحبت در این سوپر گروه را از آن بگیرید
#mute <id>/<username> : با استفاده از ایدی و یا یوزرنیم کاربر اجازه صحبت در این سوپر گروه را از آن بگیرید
#unmute : با ریپلی کردن پیامی از کاربر او را از حالت سکوت خارج کنید
#unmute <id>/<username> : با استفاده از آیدی و یا یوزرنیم کاربر او را از حالت سکوت خارج کنید
#rem : با ریپلی کردن پیامی و استفاده از این دستور ، پیام ریپلی شده پاک خواهد شد
#settings stickers enable/disable : وقتی فعال باشد ، ربات تمامی استکیر هارا پاک خواهد کرد
#settings links enable/disable : وقتی فعال باشد ، ربات  تمامی لینک هارا پاک خواهد کرد
#settings arabic enable/disabl : وقتی فعال باشد ، ربات  تمامی پیام های فارسی و یا عربی را پاک خواهد کرد
#settings bots enable/disable : وقتی فعال باشد ، با افزدون ربات به گروه/سوپر گروه ، ربات حذف خواهد شد
#settings gifs enable/disable : وقتی فعال باشد ، ربات  تمامی عکس های متحرک را پاک خواهد کرد
#settings photos enable/disable : وقتی فعال باشد ربات تمامی عکس هارا پاک خواهد کرد
#settings audios enable/disable : وقتی فعال باشد ، ربات  تمامی فایل های صوتی را پاک خواهد کرد
#settings kickme enable/disable : وقتی فعال باشد  ، کاربران نمیتوانند از دستور kickme استفاده کنند
#settings spam enable/disable : وقتی فعال باشد ، ربات  تمامی اسپم هارا پاک خواهد کرد
#settings setphoto enable/disable : وقتی فعال باشد ، در صورت تغییر عکس گروه توسط شخصی ، عکس قبلی دوباره تنظیم میشود
#settings setname enable/disable : وقتی فعال باشد ، در صورت تغییر اسم گروه ، ربات اسم قبلی را تنظیم میکند
#settings lockmember enable/disable : وقتی فعال باشد ، ربات هر شخصی را که وارد گروه میشود بیرون خواهد کرد
#settings floodtime <ثانیه>: تنظیم مقدار زمانی که بات فلود را بررسی می کند
#settings maxflood <ثانیه>: حداثکر تعداد فلود را تنظیم می کند
#setname <group title> : نام گروه را تغییر می دهد
#setphoto <then send photo> : تصویر گروه را تغییر می دهد
#link : لینک گروه را ارسال می کند
#version : نشان دادن نسخه ربات
*********************
بعضی از دستورات به # / ! در ابتدایشان نیاز ندارند
بعضی از دستورات ممکن است در گروه های معمولی کار نکنند
سوال یا مشکلی دارید ؟ به ساپورت کروکدایل مراجعه کنید
لینک ساپورت کروکدایل :
https://telegram.me/joinchat/Cdulvz5sfF1EHV0U_qUZ3A
  ]]
end

return {
  patterns = {
    "^#komak$"
  }, 
  run = run 
}

end
